<?php

namespace App;

use App\ABPTable;

class Dogovor extends ABPTable
{
    // экспорт в 1С
    use Traits\Trait1C;

    /*
        "name": "Catalog_ДоговорыКонтрагентов"
            {
            "Ref_Key": "acfb9eb8-d629-11e5-0a9b-000c295e30eb",
            "DataVersion": "AAAAAQAAAAA=",
            "DeletionMark": false,
            "Owner_Key": "a348aa8c-d629-11e5-0a9b-000c295e30eb",
            "Parent_Key": "00000000-0000-0000-0000-000000000000",
            "IsFolder": false,
            "Code": "00-000028",
            "Description": "Без договора",
            "ВалютаВзаиморасчетов_Key": "d190f831-8857-11e5-a85a-3085a93ddca2",
            "Комментарий": "",
            "Организация_Key": "39d6d856-b849-11e5-d193-000c295e30eb",
            "ПроцентКомиссионногоВознаграждения": 0,
            "СпособРасчетаКомиссионногоВознаграждения": "",
            "ТипЦен_Key": "00000000-0000-0000-0000-000000000000",
            "ВидДоговора": "СПоставщиком",
            "УчетАгентскогоНДС": false,
            "ВидАгентскогоДоговора": "",
            "РасчетыВУсловныхЕдиницах": false,
            "УдалитьРеализацияНаЭкспорт": false,
            "ВидВзаиморасчетов_Key": "00000000-0000-0000-0000-000000000000",
            "Дата": "0001-01-01T00:00:00",
            "Номер": "",
            "СрокДействия": "0001-01-01T00:00:00",
            "УстановленСрокОплаты": false,
            "СрокОплаты": "0",
            "НаименованиеДляСчетаФактурыНаАванс_Key": "00000000-0000-0000-0000-000000000000",
            "ПорядокРегистрацииСчетовФактурНаАвансПоДоговору": "",
            "Валютный": false,
            "ОплатаВВалюте": false,
            "ИспользуетсяПриОбменеДанными": false,
            "УдалитьПредъявляетНДС": true,
            "НДСПоСтавкам4и2": false,
            "Руководитель_Key": "bc99dcae-bb76-11e5-d193-000c295e30eb",
            "ЗаРуководителяПоПриказу": "",
            "ДолжностьРуководителя_Key": "fefc674f-8857-11e5-a85a-3085a93ddca2",
            "РуководительКонтрагента": "Козуляев Петр Викторович",
            "ЗаРуководителяКонтрагентаПоПриказу": "",
            "ДолжностьРуководителяКонтрагента": "Генеральный директор",
            "ФайлДоговора_Key": "00000000-0000-0000-0000-000000000000",
            "ДоговорПодписан": false,
            "ПолРуководителяКонтрагента": "",
            "ПлатежныйАгент": false,
            "ТелефонПоставщика": "",
            "НаименованиеОператораПеревода": "",
            "ИННОператораПеревода": "",
            "АдресОператораПеревода": "",
            "ТелефонОператораПеревода": "",
            "ТелефонПлатежногоАгента": "",
            "ТелефонОператораПоПриемуПлатежей": "",
            "ОперацияПлатежногоАгента": "",
            "ГосударственныйКонтракт_Key": "00000000-0000-0000-0000-000000000000",
            "КодРаздел7ДекларацииНДС_Key": "00000000-0000-0000-0000-000000000000",
            "ПризнакАгента": "",
            "УчетАгентскогоНДСПокупателем": false,
            "СчетаФактурыОтИмениОрганизации": false,
            "СпособЗаполненияСтавкиНДС": "Автоматически",
            "ЭлектронныеУслуги": false,
            "ВидОбеспеченияОбязательствИПлатежей": "",
            "ОбеспечениеПредоставил": "",
            "ОбеспечениеПредоставил_Type": "StandardODATA.Undefined",
            "ОбеспечениеПолучил": "",
            "ОбеспечениеПолучил_Type": "StandardODATA.Undefined",
            "ОбеспечениеВыданоЗа": "",
            "ОбеспечениеВыданоЗа_Type": "StandardODATA.Undefined",
            "ДополнительныеРеквизиты": [],
            "Predefined": false,
            "PredefinedDataName": "",
            "Owner@navigationLinkUrl": "Catalog_ДоговорыКонтрагентов(guid'acfb9eb8-d629-11e5-0a9b-000c295e30eb')/Owner",
            "ВалютаВзаиморасчетов@navigationLinkUrl": "Catalog_ДоговорыКонтрагентов(guid'acfb9eb8-d629-11e5-0a9b-000c295e30eb')/ВалютаВзаиморасчетов",
            "Организация@navigationLinkUrl": "Catalog_ДоговорыКонтрагентов(guid'acfb9eb8-d629-11e5-0a9b-000c295e30eb')/Организация",
            "Руководитель@navigationLinkUrl": "Catalog_ДоговорыКонтрагентов(guid'acfb9eb8-d629-11e5-0a9b-000c295e30eb')/Руководитель",
            "ДолжностьРуководителя@navigationLinkUrl": "Catalog_ДоговорыКонтрагентов(guid'acfb9eb8-d629-11e5-0a9b-000c295e30eb')/ДолжностьРуководителя"
            }
 */

    public function __construct()
    {
        parent::__construct();

        $this->name_1c('Catalog_ДоговорыКонтрагентов');
        $this->table('dogovors');
        $this->has_folders_1c(true);


        // Owner_Key, ВалютаВзаиморасчетов_Key, Организация_Key, "ВидДоговора": "СПоставщиком|СЗаказчиком", "Дата", "Номер", "СрокДействия,
        // ДоговорПодписан

        // $this->fillable(['kontragent_id','valuta_id','firm_id','dog_type_1с','doc_num','doc_date','end_date','is_write']);

        $this->model([
            ["name" => "kontragent_id", "name_1c" => "Owner", "type" => "select", "table" => "kontragents", "table_class" => "Kontragent", "title" => "Контрагент", "require" => false, "default" => 1, "index" => "index"],
            ["name" => "valuta_id", "name_1c" => "ВалютаВзаиморасчетов", "type" => "select", "table" => "valuta", "table_class" => "Valuta", "title" => "Валюта расчетов", "require" => false, "default" => 1, "index" => "index"],
            ["name" => "firm_id", "name_1c" => "Организация", "type" => "select", "table" => "firms", "table_class" => "Firm", "title" => "Организация", "require" => false, "default" => 1, "index" => "index"],
            ["name" => "dog_type_1с", "name_1c" => "ВидДоговора", "type" => "enum", "data" => ["СПоставщиком", "СЗаказчиком"], "title" => "Вид договора", "require" => true, "index" => "index"],
            ["name" => "doc_num", "name_1c" => "Номер", "type" => "string", "title" => "№ договора", "require" => true, "default" => "", "index" => "index"],
            ["name" => "doc_date", "name_1c" => "Дата", "type" => "date", "title" => "Дата договора", "require" => true, "default" => "0000-00-00", "index" => "index"],
            ["name" => "end_date", "name_1c" => "СрокДействия", "type" => "date", "title" => "Действует до", "require" => false, "default" => "0000-00-00", "index" => "index"],
            ["name" => "is_write", "name_1c" => "ДоговорПодписан", "type" => "boolean", "title" => "Подписан", "require" => true, 'default' => false, "index" => "index"],
        ]);
    }
}