<?php

namespace App;

use App\ABPTable;

class Firm extends ABPTable

{
    // экспорт в 1С
    use Traits\Trait1C;

    /*
        "name": "Catalog_Организации"
            {
            "Ref_Key": "39d6d856-b849-11e5-d193-000c295e30eb",
            "DataVersion": "AAAAAQAAAAA=",
            "DeletionMark": false,
            "Code": "00-000001",
            "Description": "ТЕХНО-КОНСАЛТ ООО",
            "ВидОбменаСКонтролирующимиОрганами": "ОбменВУниверсальномФормате",
            "ВидОбменаСКонтролирующимиОрганами_Type": "StandardODATA.ВидыОбменаСКонтролирующимиОрганами",
            "ГоловнаяОрганизация_Key": "39d6d856-b849-11e5-d193-000c295e30eb",
            "КПП": "501701001",
            "КодНалоговогоОргана": "5017",
            "ИНН": "5024085443",
            "ДополнительныйКодФСС": "",
            "ЕстьОбособленныеПодразделения": false,
            "ИндивидуальныйПредприниматель_Key": "00000000-0000-0000-0000-000000000000",
            "ДатаРегистрации": "2007-01-31T00:00:00",
            "КодНалоговогоОрганаПолучателя": "",
            "СвидетельствоНаименованиеОргана": "",
            "СвидетельствоКодОргана": "",
            "ОсновнойБанковскийСчет_Key": "fd515228-c9b2-11e5-6d86-000c295e30eb",
            "КодОрганаПФР": "060-016",
            "УдалитьКодПоОКАТО": "",
            "КодОрганаФСГС": "50-50-00",
            "КодПоОКПО": "99125801",
            "НаименованиеНалоговогоОргана": "Инспекция Федеральной налоговой службы по г.Истре Московской области",
            "КодПодчиненностиФСС": "50231",
            "ИПРегистрационныйНомерПФР": "",
            "КрупнейшийНалогоплательщик": false,
            "НаименованиеПолное": "Общество с ограниченной ответственностью \"ТЕХНО-КОНСАЛТ\"",
            "НаименованиеСокращенное": "ООО \"ТЕХНО-КОНСАЛТ\"",
            "РегистрационныйНомерТФОМС": "",
            "ИПРегистрационныйНомерТФОМС": "",
            "НаименованиеТерриториальногоОрганаПФР": "ГОСУДАРСТВЕННОЕ УЧРЕЖДЕНИЕ - УПРАВЛЕНИЕ ПЕНСИОННОГО ФОНДА РФ №27 ИСТРИНСКИЙ РАЙОН МОСКОВСКОЙ ОБЛАСТИ",
            "НаименованиеТерриториальногоОрганаФСС": "Филиал 23 ГУ – Московское Областного регионального отделения ФСС РФ",
            "ИПРегистрационныйНомерФСС": "",
            "УдалитьИПКодПодчиненностиФСС": "",
            "ОбменКаталогОтправкиДанныхОтчетности": "",
            "ОбменКаталогПрограммыЭлектроннойПочты": "",
            "КодОКОНХ": "",
            "ОбменКодАбонента": "",
            "ОбособленноеПодразделение": false,
            "ПрефиксБП20": "",
            "ОГРН": "1075024000512",
            "ПрименятьРайонныйКоэффициент": false,
            "ПрименятьСевернуюНадбавку": false,
            "РайонныйКоэффициент": 1,
            "ИностраннаяОрганизация": false,
            "НаименованиеИнострОрганизации": "",
            "СтранаРегистрации_Key": "00000000-0000-0000-0000-000000000000",
            "КодВСтранеРегистрации": "",
            "СтранаПостоянногоМестонахождения_Key": "00000000-0000-0000-0000-000000000000",
            "Префикс": "К1",
            "РегистрационныйНомерФСС": "5023107819",
            "РегистрацияВНалоговомОргане_Key": "a552dc46-b84a-11e5-d193-000c295e30eb",
            "УдалитьТерриториальныеУсловияПФР_Key": "00000000-0000-0000-0000-000000000000",
            "РегистрационныйНомерПФР": "060-016-021639",
            "ВариантНаименованияДляПечатныхФорм": "СокращенноеНаименование",
            "НаименованиеПлательщикаПриПеречисленииВБюджет": "",
            "СвидетельствоДатаВыдачи": "0001-01-01T00:00:00",
            "СвидетельствоСерияНомер": "",
            "УчетнаяЗаписьОбмена": "72182917-43d8-11e9-8e2c-000c29346a0e",
            "УчетнаяЗаписьОбмена_Type": "StandardODATA.Catalog_УчетныеЗаписиДокументооборота",
            "КодОКВЭД": "72.60",
            "ЦифровойИндексОбособленногоПодразделения": "0",
            "НаименованиеОКВЭД": "Прочая деятельность, связанная с использованием вычислительной техники и информационных технологий",
            "КодОКВЭД2": "62.09",
            "НаименованиеОКВЭД2": "Деятельность, связанная с использованием вычислительной техники и информационных технологий, прочая",
            "ТерриториальныеУсловияПФР_Key": "00000000-0000-0000-0000-000000000000",
            "КодОКОПФ": "12300",
            "НаименованиеОКОПФ": "Общества с ограниченной ответственностью",
            "ВидСтавокЕСНиПФР": "ДляНеСельскохозяйственныхПроизводителей",
            "УдалитьЮрФизЛицо": "",
            "УдалитьКодИФНС": "",
            "КодОКФС": "16",
            "ФайлЛоготип_Key": "00000000-0000-0000-0000-000000000000",
            "ФайлФаксимильнаяПечать_Key": "00000000-0000-0000-0000-000000000000",
            "ФайлПечать_Key": "00000000-0000-0000-0000-000000000000",
            "ФайлПодписьРуководителя_Key": "00000000-0000-0000-0000-000000000000",
            "ФайлПодписьГлавногоБухгалтера_Key": "00000000-0000-0000-0000-000000000000",
            "УдалитьРайонныйКоэффициентРФ": 1,
            "УдалитьФайлЛоготип_Key": "00000000-0000-0000-0000-000000000000",
            "УдалитьФайлФаксимильнаяПечать_Key": "00000000-0000-0000-0000-000000000000",
            "УдалитьИПИспользуетТрудНаемныхРаботников": false,
            "РайонныйКоэффициентРФ": 1,
            "ДополнительныеУсловияПоУмолчанию_Key": "e1ae2c7d-8857-11e5-a85a-3085a93ddca2",
            "НекредитнаяФинансоваяОрганизация": false,
            "КодОсновногоВидаДеятельностиНФО": "",
            "КодИныхВидовДеятельностиНФО": "",
            "НаименованиеОсновногоВидаДеятельностиНФО": "",
            "НаименованиеИныхВидовДеятельностиНФО": "",
            "УдалитьФайлПечать_Key": "00000000-0000-0000-0000-000000000000",
            "УдалитьФайлПодписьРуководителя_Key": "00000000-0000-0000-0000-000000000000",
            "УдалитьФайлПодписьГлавногоБухгалтера_Key": "00000000-0000-0000-0000-000000000000",
            "ФамилияИП": "",
            "ИмяИП": "",
            "ОтчествоИП": "",
            "НаименованиеОКФС": "Частная собственность",
            "ЮридическоеФизическоеЛицо": "ЮридическоеЛицо",
            "УдалитьGLN": "",
            "ДополнительныеКодыОКВЭД2": "",
            "НаименованиеРегистрирующегоОргана": "",
            "КонтактнаяИнформация": [],
            "ДополнительныеРеквизиты": [],
            "ИсторияНаименований": [],
            "ИсторияКонтактнойИнформации": [],
            "Predefined": false,
            "PredefinedDataName": "",
            "ГоловнаяОрганизация@navigationLinkUrl": "Catalog_Организации(guid'39d6d856-b849-11e5-d193-000c295e30eb')/ГоловнаяОрганизация",
            "ОсновнойБанковскийСчет@navigationLinkUrl": "Catalog_Организации(guid'39d6d856-b849-11e5-d193-000c295e30eb')/ОсновнойБанковскийСчет",
            "РегистрацияВНалоговомОргане@navigationLinkUrl": "Catalog_Организации(guid'39d6d856-b849-11e5-d193-000c295e30eb')/РегистрацияВНалоговомОргане",
            "ДополнительныеУсловияПоУмолчанию@navigationLinkUrl": "Catalog_Организации(guid'39d6d856-b849-11e5-d193-000c295e30eb')/ДополнительныеУсловияПоУмолчанию"
 */

    public function __construct()
    {
        parent::__construct();

        $this->name_1c('Catalog_Организации');
        $this->table('firms');
        $this->has_folders_1c(false);
        // уникальный ключ
        $this->unique_key(['inn', 'kpp']);

        // $this->fillable(['kpp','inn','reg_date','rs_id','okpo','full_name','short_name','ogrn','okved','okopf','firstname_ip',
        //     'name_ip','father_name_ip','dop_okved']);

        $this->model([
            ["name" => "kpp", "name_1c" => "КПП", "type" => "string", "title" => "КПП", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "inn", "name_1c" => "ИНН", "type" => "string", "title" => "ИНН", "require" => true, "index" => "index"],
            ["name" => "reg_date", "name_1c" => "ДатаРегистрации", "type" => "date", "title" => "Дата Регистрации", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "rs_id", "name_1c" => "ОсновнойБанковскийСчет", "type" => "select", "table" => "rs", "table_class" => "RS", "title" => "Основной расчетный счет", "require" => false, "default" => 1, "index" => "index", "show_in_table" => false, "show_in_form" => false],
            ["name" => "okpo", "name_1c" => "КодПоОКПО", "type" => "string", "title" => "Код по ОКПО", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "full_name", "name_1c" => "НаименованиеПолное", "type" => "string", "title" => "Полное наименование", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "short_name", "name_1c" => "НаименованиеСокращенное", "type" => "string", "title" => "Сокращенное наименование", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "ogrn", "name_1c" => "ОГРН", "type" => "string", "title" => "ОГРН", "require" => true, "index" => "index"],
            ["name" => "okved", "name_1c" => "КодОКВЭД2", "type" => "string", "title" => "Код ОКВЭД", "require" => false, "index" => "index"],
            ["name" => "okopf", "name_1c" => "КодОКОПФ", "type" => "string", "title" => "Код ОКОПФ", "require" => false, "index" => "index"],
            ["name" => "firstname_ip", "name_1c" => "ФамилияИП", "type" => "string", "title" => "Фамилия ИП", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "name_ip", "name_1c" => "ИмяИП", "type" => "string", "title" => "Имя ИП", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "father_name_ip", "name_1c" => "ОтчествоИП", "type" => "string", "title" => "Отчество ИП", "require" => false, "index" => "index", "show_in_table" => false],
            ["name" => "dop_okved", "name_1c" => "ДополнительныеКодыОКВЭД2", "type" => "string", "title" => "Дополнительные коды ОКВЭД", "require" => false, "index" => "index", "show_in_table" => false],
        ]);

        $this->sub_tables([
            [
                "table" => "sotrudniks", "icon" => "mdi-account", "class" => "Kontragent", "method" => "employees", "title" => "Сотрудники", "item_class" => "App\Sotrudnik", "belongs_method" => "employeable",
                "keys" => ["morph" => "employeable", "references" => "id", "foreign_table" => "sotrudniks", "reference_table" => "kontragents"]
            ],
            [
                "table" => "rs", "icon" => "mdi-bank", "class" => "RS", "method" => "rs_", "title" => "Расчетные счета", "item_class" => "App\RS", "belongs_method" => "rs_table",
                "keys" => ["morph" => "rs_table", "references" => "id", "foreign_table" => "rs", "reference_table" => "kontragents"]
            ],
        ]);
    }

    // расчетные счета
    public function rs_()
    {
        return $this->morphMany('App\RS', 'rs_table');
    }
    // сотрудники
    public function employees()
    {
        return $this->morphMany('App\Sotrudnik', 'employeable');
    }
}
