<?php

// настроечный файл разработки АБП

return [

    /*
    |--------------------------------------------------------------------------
    | Google Chrome bi file
    |--------------------------------------------------------------------------
    |
    | Исполняемый файл хрома для генерации PDF из HTML
    |
    */

    'chrome_bin' => env('CHROME_BIN', NULL),

    /*
    |--------------------------------------------------------------------------
    | 1C Export setting
    |--------------------------------------------------------------------------
    |
    | url odata-сервера 1С, логин и пароль для базовой аутентификации в 1С
    |
    */

    '1c_odata_url' => env('1C_ODATA_URL', NULL),
    '1c_odata_login' => env('1C_ODATA_LOGIN', NULL),
    '1c_odata_password' => env('1C_ODATA_PASSWORD', NULL),


    /*
    |--------------------------------------------------------------------------
    | Storage settings
    |--------------------------------------------------------------------------
    |
    | значения обрезки изображений
    |
    */

    'thmb_width' => env('THMB_WIDTH', 130),

];